import React from "react";

const AdvanceField = () => {
  return (
    <div>
      <h1>진출분야</h1>
      <h2>졸업 후 진로</h2>
      <p>
        소프트웨어가 오늘날 지식정보화 사회의 혁신과 성장의 중심이 되고 있으며
        이에 따른 소프트웨어 기술의 수요가 크게 증가 하고 있습니다. 또한
        소프트웨어 기술을 헬스, 바이오, 로봇, 금융, 경영, 인문학 등 다양한
        분야에 적용하여 새로운 가치를 창출하는 소프트웨어 융합에 대한 수요도
        급속히 증가 하고 있습 니다. 따라서 소프트웨어학부 졸업생들은
        컴퓨터과학/소프트웨어/소프트웨어융합 분야의 전문적인 역량을 필요 로 하는
        직종으로 진출하게 됩니다. 소프트웨어학부의 교육과정은 단순한 기술인이
        아닌 소프트웨어가 응용되는 모든 제반 분야의 지식과 실무능력을 함양한
        전문인재를 양성하기 때문에, 본 학부의 훌륭한 교수진과 선배님들의 우수한
        자질은 사회 각 분야에서 그 전문성이 인정 되어 왔습니다. 그 결과
        소프트웨어학부 졸업생에 대한 구인 선호도는 매우 높으며, 취업한 기업의
        상당수가 우리나라 IT 산업을 이끄는 선도 기업들 입니다. 또한 국가 및
        공공기관 연구소, 금융기관, 언론기관, 외국계 기업의 컴퓨터 관련직에도
        진출하며, 교직 과목을 이수하여 전산교사, 대학원에 진학하여 강사나 교수,
        연구원이 되기도 합니다 .
      </p>
      <h2>졸업 후 진출 분야</h2>
      <ol>
        <li>
          대기업 - LG 전자, LG CNS, LG U+, 삼성전자, 삼성 SDS, SK Telecom, KT,
          CJ, 현대자동차
        </li>
        <li>소프트웨어 전문기업 - 네이버, 카카오, NC 소프트</li>
        <li>외국계 기업 - Apple, Google, Facebook, IBM, Microsoft, Oracle</li>
        <li>
          금융회사 - 한국은행, 신한은행, 국민은행, 기업은행, 새마을금고, 농협
        </li>
        <li>
          정부기관 - 행정안전부, 과학기술정보통신부, 국방부(군 정보통신 병과)
        </li>
        <li>
          정부출연 연구기관 - 한국전자통신연구원 (ETRI), 한국과학기술연구원
          (KIST), 정보통신정책연구원, 국가보안기술연구소, 국방과학연구소 (ADD)
        </li>
        <li>
          공기업 / 정부산하기관 - 도로교통공단, 서울도시철도공사,
          전자부품연구원, 한국인터넷진흥원 (KISA), 한국정보화진흥원 (NIA),
          소프트웨어정책연구소
        </li>
        <li>대학원 진학 / 교육기관</li>
      </ol>
    </div>
  );
};

export default AdvanceField;
