export const CScourseList = [
  {
    id: 21002144,
    name: "프로그래밍개론",
    type: "전공선택",
    grade: 100,
    credit: 3,
    detail:
      "프로그램의 설계와 작성, 컴파일러의 사용 방법과 프로그램의 실행, 프로그래밍 언어의 이해, 프로그램의 작성 연습 등을 다룬다.",
  },
  {
    id: 21003917,
    name: "소프트웨어의이해",
    type: "전공선택",
    grade: 101,
    credit: 3,
    detail:
      "본 교과목은 컴퓨터과학전공의 기초설계과목으로 창의적 공학설계의 기법을 이해하고 배운다. 주어진 제약조건 내에서 목적달성을 위한 공학설계와 프로젝트 기반의 접근방법을 통해, 팀별 작업과 고객지향적 설계 프로젝트를 효과적으로 수행하기 위한 개념설계 방법및 프로젝트 관리도구들을 응용하는 방법을 학습한다. 또한, 설계 프로젝트 결과를 보고하는 수단을 체계화하며, 팀의 행동과 동적 활동에 유용한 통찰력을 부여하고, 공학실천에 있어서의 윤리에 대해서도 공부한다.",
  },
  {
    id: 21002146,
    name: "윈도우프로그래밍",
    type: "전공선택",
    grade: 201,
    credit: 3,
    detail:
      "프로그램의 설계와 작성, 객체지향적 프로그래밍 개념과 연습, GUI, 예외 처리와 병렬성 표현, 재귀법, 알고리즘과 자료 구조의 표현 등을 다루며, 프로그래밍 I을 선수 과목으로 한다.",
  },
  {
    id: 21000557,
    name: "자바프로그래밍",
    type: "전공선택",
    grade: 202,
    credit: 3,
    detail:
      "응용 소프트웨어 개발에 적합한 언어 및 개발 환경의 습득과 소프트웨어 개발 훈련을 목표로 한다. ",
  },
  {
    id: 21001713,
    name: "리눅스시스템",
    type: "전공선택",
    grade: 202,
    credit: 3,
    detail:
      "데이터 처리와 응용을 위한 시스템을 파일 및 프로세스를 중심으로 학습한다. 파일의 기본 개념 및 사용법, 파일 구조, 파일 입출력, 프로세스 등을 Unix 시스템을 중심으로 공부하며 특히 파일을 이용한 대량의 데이터의 체계적 조직과 효율적 처리 기술을 습득한다.      ",
  },
  {
    id: 21002147,
    name: "컴퓨터수학",
    type: "전공선택",
    grade: 102,
    credit: 3,
    detail:
      "컴퓨터과학의 이론적 기초가 되는 집합, 관계 및 함수, 조함, 그래프와 트리, 대수이론, 오토마타 등의 개념과 응용을 배운다.    ",
  },
  {
    id: 21001710,
    name: "디지털논리회로",
    type: "전공필수",
    grade: 202,
    credit: 3,
    detail:
      "회로설계의 입문을 위해 진법 체계, Boolean Algebra를 배운 후 Combinational Logic, Sequential Logic의 구현 과정과 이를 사용한 기본적 회로인 Encoder, Decoder, Counter, Adder등의 컴퓨터 기본 동작 회로를 설계할 수 있는 능력을 키운다. 다음 단계로 앞서 배운 것들을 조합, 응응하여 간단한 컴퓨터 시스템의 Control Logic과 구현 방법을 배운다. 본과목은 컴퓨터 구조II의 선수 과목이다.    ",
  },
  {
    id: 21000540,
    name: "자료구조",
    type: "전공필수",
    grade: 201,
    credit: 3,
    detail:
      "데이터 및 정보의 효과적 처리를 위한 구성 방법과 분석, 추상적 자료형의 표현 및 이용, 이들을 활용하는 기본적인 알고리즘 등을 공부한다.    ",
  },
  {
    id: 21001714,
    name: "웹시스템설계",
    type: "전공선택",
    grade: 201,
    credit: 3,
    detail:
      "인터넷 상의 World Wide Web 환경에 대해서 알아보고, 각 환경에 따른 여러가지의 프로그래밍 기법을 배운다. 또한 독립된 웹서버를 설치, 운영하는 방법을 배운다. 객체 지향 모델링 개념을 이해하고, 웹 시스템 분석 및 설계 능력을 배양한다.모델링 개념과 구현 개념과의 연관성을 파악하고, 객체지향 모델링을 통한 소프트웨어 개발 능력 배양을 목표로 한다.    ",
  },
  {
    id: 21000555,
    name: "소프트웨어공학",
    type: "전공선택",
    grade: 302,
    credit: 3,
    detail:
      "대형자료처리 소프트웨어 시스템 개발과 유지 관리에 따른 복잡한 공정상의 문제를 해결하기 위한 여러 가지 방법을 공학적인 측면에서 연구하여 개발된 소프트웨어의 생산성, 효율성, 신뢰성 등을 높이게 한다.    ",
  },
  {
    id: 21000547,
    name: "수치해석",
    type: "전공선택",
    grade: 202,
    credit: 3,
    detail:
      "과학, 공학 및 경영의사결정에 이용되는 여러 가지 수학적 문제들을 수치 해법을 사용하여 Computer로 처리할 수 있는 방법을 강의한다.    ",
  },
  {
    id: 21000549,
    name: "알고리즘",
    type: "전공필수",
    grade: 302,
    credit: 3,
    detail:
      "계산문제와 알고리즘의 개념, 알고리즘 표현 및 분석, 알고리즘 작성 기법과 정렬 및 검색, 그래프, 기하, 수리 등에의 응용, 병렬 알고리즘, 계산문제의 컴플렉서티 이론과 리덕션 등을 공부한다.    ",
  },
  {
    id: 21001711,
    name: "컴퓨터구조",
    type: "전공선택",
    grade: 302,
    credit: 3,
    detail:
      "전산학을 전공하는 학생들에게 컴퓨터의 구조에 관한 제반의 사항들에 대해 학습하도록 하며, 실제로 컴퓨터가 어떻게 구성되어 있고, 이를 어떻게 설계하는지에 관해서 심층적으로 학습한다. 이러한 과정을 통해서 학습자는 프로그램이 컴퓨터 상에서 어떻게 실행되는지를 구조적 관점에서 자세한 이해를 할 수 있다. 이 과목은 '컴퓨터구조I'를 선수과목으로 한다.    ",
  },
  {
    id: 21000558,
    name: "컴퓨터그래픽스",
    type: "전공선택",
    grade: 202,
    credit: 3,
    detail:
      "본 과목은 컴퓨터 그래픽스의 기본 원리 및 응용을 배운다. 그래픽스의 개요, 그래픽스용 하드웨어, 개발 환경 등을 배우며, C언어 또는 OPEN GL Tool을 이용하여 2차원, 3차원 Object의 표현 및 변화, 투시 투영도의 작성, 은둔선 제거, 조명 효과 등을 배운다.    ",
  },
  {
    id: 21003186,
    name: "컴퓨터네트워크I",
    type: "전공선택",
    grade: 302,
    credit: 3,
    detail:
      "데이터통신 개요, 데이터 통신부호, 데이터 회선망 구성, 에러 정정 방식, 부호의 전송, 변복조 방식 및 데이터통신 단말장치를 배운다.    ",
  },
  {
    id: 21003183,
    name: "데이터베이스설계와질의",
    type: "전공선택",
    grade: 302,
    credit: 3,
    detail:
      "데이터베이스 설계의 요구 사항 분석과 논리적 설계, 대표적인 데이터베이스 모델링 기법인 ER(Entity Relationship) 모델을 배운다. ER 모델을 관계형 모델로 바꾸는 법을 배우며, 관계형 데이터베이스 질의를 위한 관계 대수와 대표적 상용 질의어인 SQL 을 학습하고, 데이터베이스 응용 프로그래밍 기법에 대한 기본 지식을 습득한다.    ",
  },
  {
    id: 21000542,
    name: "운영체제",
    type: "전공필수",
    grade: 301,
    credit: 3,
    detail:
      "데이터베이스 설계의 요구 사항 분석과 논리적 설계, 대표적인 데이터베이스 모델링 기법인 ER(Entity Relationship) 모델을 배운다. ER 모델을 관계형 모델로 바꾸는 법을 배우며, 관계형 데이터베이스 질의를 위한 관계 대수와 대표적 상용 질의어인 SQL 을 학습하고, 데이터베이스 응용 프로그래밍 기법에 대한 기본 지식을 습득한다.    ",
  },
  {
    id: 21000545,
    name: "프로그래밍언어론",
    type: "전공필수",
    grade: 301,
    credit: 3,
    detail:
      "여러 유형의 프로그래밍 언어를 구조, 의미론, 활용성 등의 관점에서 비교 분석하고, 프로그래밍 언어의 구문법과 설계원리 등을강의한다.    ",
  },
  {
    id: 21003276,
    name: "시스템프로그래밍",
    type: "전공선택",
    grade: 301,
    credit: 3,
    detail:
      "운영체제 시스템 호출을 이용한 시스템 프로그래밍 능력 개발을 목표로 한다. 이를 위하여 Unix를 중심으로 파일 및 입출력,프로세스, 예외처리, 프로세스간 통신 등의 시스템 호출을 학습한다.    ",
  },
  {
    id: 21002031,
    name: "네트워크보안",
    type: "전공선택",
    grade: 402,
    credit: 3,
    detail:
      "이 과목은 인터넷에서의 각종 보안 위협의 이해와 대처를 위한 방법을 학습하며, 암호학, 패스워드, 보안 관련 도구, 전자 우편 보안, 운영체제별 보안, 방화벽, 웹 보안 등의 주제들을 포함한다.    ",
  },
  {
    id: 21003184,
    name: "데이터베이스프로그래밍",
    type: "전공선택",
    grade: 401,
    credit: 3,
    detail:
      "데이터베이스 이론과 프로그래밍 기술을 이용한 데이터베이스 활용 기법을 습득한다. 이를 위해 고급 질의 기법, 데이터베이스를 활용한 프로그래밍 기법을 습득한다. 더 나아가 이를 적용한 실전 프로젝트를 통해 그 활용 기법을 확고히 정립한다. 데이터베이스활용 기법을 심도 있게 익힘으로써 과목을 이수한 후에는 데이터베이스 활용 개발자가 되도록 하는데 그 목표가 있다.    ",
  },
  {
    id: 21003757,
    name: "모바일소프트웨어",
    type: "전공선택",
    grade: 302,
    credit: 3,
    detail:
      "스마트폰, 태블릿과 같은 모바일 컴퓨팅 환경에 관련된 모바일 무선 통신, 응용 기술, 개발 플랫폼 및 개발 도구 등에 대한 기본적인 개념과 원리에  대하여 배우며, 프로그래밍 실습을 통하여 모바일 응용 프로그램을 설계하고 개발하는 지식을 습득한다.    ",
  },
  //   {
  //     id: 21003735,
  //     name: "분산처리",
  //     type: "전공선택",
  //     grade: 1,
  //     credit: 3,
  //     detail:
  //       "본교과목은 네트워크로 연결된 다수의 독립적인 컴퓨터들이 서로 협동하여 하나의 목적을 위한 분산처리를 수행하는 분산시스템의 기본 구조 및 분산 응용 프로그램에 대한 소개를 한다. 분산 미들웨어, 분산 서비스 및 응용 프로그램의 설계 방법 및 알고리즘에대해서 학습하고 응용 예제를 통하여 실제 활용능력을 습득한다. 관련된 최신 기술 동향에 대해 파악한다.    ",
  //   },
  {
    id: 21003758,
    name: "시스템종합설계",
    type: "전공선택",
    grade: 401,
    credit: 3,
    detail:
      "본 교과목은 학과에서 습득한 기초설계, 심화설계 능력을 기반으로 종합설계 능력을 향상시키기 위한 방법으로 중대형 규모의 소프트웨어 설계 능력의 향상을 목표로 하고 있다. 수강생들은 졸업 작품 이전 학기에 이 과목을 수강하며 주제 선정, 소프트웨어의 명세와 설계, 발표 등을 실습하며 3명으로 구성되는 팀 작업이 권장된다.    ",
  },
  {
    id: 21003187,
    name: "영상정보처리",
    type: "전공선택",
    grade: 402,
    credit: 3,
    detail:
      "본 교과목은 기본적인 프로그래밍 실력이 갖추어진 정보과학부 3, 4학년 학생을 대상으로 다양한 종류의 영상처리 응용을 위한 이론적인 내용과 이를 프로그램으로 구현하는 방법을 배운다. 영상처리 응용은 의료 영상의 해석, 로봇의 자동 주행 및 지능개선을위한 시각 처리, 생체 정보 인식, 핸프폰 카메라를 이용한 응용, PDA/핸드폰 자동 문자 인식, 이미지 보안을 위한 Watermarking 등 실생활에 필요한 첨단 시스템에 응용되고 있다. 따라서 본 교과목의 구성은 영상처리 분야에 필요한 이론적인내용을 배우는 강의식 수업과 이를 프로그램으로 구현하고 응용, 설계하는 PBL 수업을 함께 진행한다. 이는 영상처리 분야의 이론과 실습의 유기적인 결합을 통한 실제적인 활용 능력과 자주적인 문제 해결 능력, 공동 의사결정 및 업무 수행, 팀 활동 등협업 소양 능력을 함께 배양하기 위함이다.    ",
  },
  {
    id: 21000550,
    name: "인공지능",
    type: "전공선택",
    grade: 401,
    credit: 3,
    detail:
      "인공지능이란 컴퓨터를 인간과 같은 지능을 갖을 수 있도록 하는 학문이다. 지식의 여러 표현방법, 다양한 탐색방법, 경험을 기초로한 문제해결의 패러다임, 전문가 System, Planning, Running 등을 공부한다.    ",
  },
  {
    id: 21003759,
    name: "임베디드시스템",
    type: "전공선택",
    grade: 341,
    credit: 3,
    detail:
      "임베디드 시스템은 휴대폰, 자동차, 가전 제품등에 내장되는 컴퓨터 시스템으로 일반적인 컴퓨터에 비해 자원에 제약이 있고 특정목적에 부합되게 설계되어진다. 본 교과목은 이러한 임베디드 시스템의 기초와 특징을 이해하고 최신 동향을 살펴본다. 또한 임베디드 하드웨어/소프트웨어 설계용 시뮬레이션 툴을 사용하여 실습이 이루어지며, 이러한 실습을 통해 임베디드 시스템을 설계하는 기본 기술을 습득한다.    ",
  },
  {
    id: 21001715,
    name: "컴파일러",
    type: "전공선택",
    grade: 401,
    credit: 3,
    detail:
      "컴파일러 모델들을 비교하고, 컴파일러 구성의 이론적 기초가 되는 형식 언어와 문법을 공부하며, 구문 분석 기법, 테이블관리,오류처리, 코드 생성 및 향상 기법 , 보조 소프트웨어의 사용법 등을 익히는 것을 목표로 한다.    ",
  },
  //   {
  //     id: 21003202,
  //     name: "컴퓨터네트워크II",
  //     type: "전공선택",
  //     grade: 1,
  //     credit: 3,
  //     detail:
  //       "정보화와 컴퓨터의 대중화에 따른 컴퓨터 상호간을 연동하기 위한 컴퓨터 통신의 기본 원리 및 통신 시스템, 네트워크 구조와프로토콜 기술들을 습득한다. 이를 바탕으로 기업 내에서 Local Area Network (LAN) 및 Wide Area Network (WAN) 등의 컴퓨터 네트워크를 구축하는 방법 및 상호 연동하는 응용 기술 등을 습득한다.    ",
  //   },
  {
    id: 21003761,
    name: "컴퓨터특강",
    type: "전공선택",
    grade: 402,
    credit: 3,
    detail:
      "전산학 전반에 걸쳐 최신 주제의 연구 분야 중 정규 교과목으로 흡수 또는 확립되지 않은 주제들을 학습하고, 그 밖의 최근 컴퓨터 과학 기술 동향을 소개한다.    ",
  },
  {
    id: 21009627,
    name: "논리및논술(정보·컴퓨터)",
    type: "전공선택",
    grade: "교직",
    credit: 3,
    detail:
      "컴퓨터과학에서 활용되는 논리와 논리적 서술 방법 교육에 대한 내용을 소개한다.    ",
  },
  {
    id: 21050161,
    name: "정보·컴퓨터교재연구및지도법",
    type: "전공선택",
    grade: "교직",
    credit: 3,
    detail:
      "전산학의 다양한 분야에 관한 학생의 교수 및 지도법을 강의한다. 강의의 질과 수준, 질문에 대한 답변 능력 등을 배양한다.    ",
  },
  {
    id: 21009873,
    name: "정보·컴퓨터교육론",
    type: "전공선택",
    grade: "교직",
    credit: 3,
    detail:
      "교수이론의 역사적 고찰, 교수 이론의 탐색, 탐구적 실습지도방법 등을 활용하여 개인차에 의한 교수방법 등 각종 교수과정의모형을 분석하여 전산교육에 유용한 접근 방법을 배운다.    ",
  },
];

export const SCcourseList = [
  {
    id: 21003917,
    name: "소프트웨어의이해",
    type: "전공선택",
    grade: 101,
    credit: 3,
    detail:
      "컴퓨터과학전공의 기초설계과목으로 창의적 공학설계의 기법을 이해하고 배운다. 주어진 제약조건 내에서 목적달성을 위한 공학설계와 프로젝트 기반의 접근방법을 통해, 팀별 작업과 고객지향적 설계 프로젝트를 효과적으로 수행하기 위한 개념설계 방법 및 프로젝트 관리도구들을 응용하는 방법을 학습한다. 또한, 설계 프로젝트 결과를 보고하는 수단을 체계화하며, 팀의 행동과 동적 활동에 유용한 통찰력을 부여하고, 공학실천에 있어서의 윤리에 대해서도 공부한다.    ",
  },
  {
    id: 21002147,
    name: "컴퓨터수학",
    type: "전공선택",
    grade: 102,
    credit: 3,
    detail:
      "컴퓨터과학의 이론적 기초가 되는 집합, 관계 및 함수, 조함, 그래프와 트리, 대수이론, 오토마타 등의 개념과 응용을 배운다.    ",
  },
  {
    id: 21002144,
    name: "프로그래밍개론",
    type: "전공선택",
    grade: 100,
    credit: 3,
    detail:
      "프로그램의 설계와 작성, 컴파일러의 사용 방법과 프로그램의 실행, 프로그래밍 언어의 이해, 프로그램의 작성 연습 등을 다룬다.",
  },
  {
    id: 21003032,
    name: "통계학입문",
    type: "교양핵심",
    grade: 100,
    credit: 3,
    detail:
      "경제학, 경영학을 비롯한 사회과학 및 수학, 통계학을 제외한 자연과학을 전공하는 학생들에게 기초적인 통계학 을 강의하는 교양과목이다. 추정 및 검정의 기본 개념을 공부하고, 상관분석, 단순회귀분석, 분산분석, 범주형 자 료분석 등 보편적인 자료분석 방법들이 소개된다.",
  },
  {
    id: 21003946,
    name: "컴퓨터과학의이해",
    type: "교양핵심",
    grade: 100,
    credit: 3,
    detail:
      "컴퓨터의 역사, 하드웨어 구성, 소프트웨어 설계방법, 운영체제의 기능 등을 공부하며 컴퓨터과학 분야의 최신동 향을 소개한다.",
  },
  {
    id: 21102904,
    name: "데이터사이언스개론",
    type: "전공필수",
    grade: 201,
    credit: 3,
    detail:
      "빅데이터 시대의 요구에 맞게 부상하고 있는 새로운 학제간 연구 분야인 데이터 사이언스의 개요를 다루는 교과목이다. 이 교과목을 통해 데이터의 통계, 데이터 시각화, 데이터의 분석 등의 문제 해결을 위한 여러 연구 도구나 기술들을 익히게 될 것이다. 본 교과목은 데이터 수집부터 분석에 이르는 과정, 데이터를 다루는 도구들, 통계적 모델과 기계 학습, 그리고 실생활 사례들을 중점적으로 다룰 것이다.    ",
  },
  {
    id: 21000540,
    name: "자료구조",
    type: "전공필수",
    grade: 201,
    credit: 3,
    detail:
      "데이터 및 정보의 효과적 처리를 위한 구성 방법과 분석, 추상적 자료형의 표현 및 이용, 이들을 활용하는 기본적인 알고리즘 등을 공부한다.    ",
  },
  {
    id: 21001083,
    name: "경영정보시스템",
    type: "전공선택",
    grade: 201,
    credit: 3,
    detail:
      "기업이 처한 무한경쟁의 상황에서 정보시스템의 성공적인 활용은 기업의 존폐와 직결되는 사항이다. 기업의 효율적 경영을 위해서는 관련 정보가 효과적으로 수집, 분석, 활용되어야 하는 것이다. 본 과목에서는 경영학 전공자가 기본적으로 알아야 하는 경영정보시스템 관련 사항을 종합적으로 다룬다. 즉, 경영의사결정 및 업무능력 향상을 위한 효과적인 정보관리를 위하여 경영정보시스템의 기본적 구조, 기본 기법 및 여러 하위시스템의 설계에 관한 연구를 한다.s",
  },
  {
    id: 21102913,
    name: "인터넷기술융합",
    type: "전공선택",
    grade: 201,
    credit: 3,
    detail:
      "인터넷 기술과 소프트웨어가 융합하여 제공되는 응용과 서비스 패러다임에 대해 학습한다. 인터넷 기본구조 및 응용 (웹, 모바일 컴퓨팅, 소셜 네트워킹, 클라우드 컴퓨팅)을 학습한다. 사물인터넷 기반 초연결시대의 ICT 기술 융합에 대해 이해하고 융합분야 사례를 학습한다.",
  },
  {
    id: 21102908,
    name: "컴퓨터시스템기초",
    type: "전공선택",
    grade: 202,
    credit: 3,
    detail:
      "컴퓨터 시스템의 구조에 관한 제반의 사항들을 이해하기 위해 우선 회로설계의 입문을 학습한다. 먼저, 진법 체계, Boolean Algebra를 배운 후Combinational Logic의 구현 과정과 이를 사용한 기본적 회로인 Encoder, Decoder, Counter, Adder등의 컴퓨터 기본 동작 회로를 설계할 수 있는 능력을 키운다. 다음 단계로 실제로 컴퓨터가 어떻게 구성되어 있고, 이를 어떻게 설계하는지에 관한 기본적 내용들을 학습하여 프로그램이 컴퓨터상에서 어떻게 실행되는지를 구조적 관점에서 이해할 수 있도록 한다.",
  },
  {
    id: 21000557,
    name: "자바프로그래밍",
    type: "전공선택",
    grade: 202,
    credit: 3,
    detail:
      "응용 소프트웨어 개발에 적합한 언어 및 개발 환경의 습득과 소프트웨어 개발 훈련을 목표로 한다.    ",
  },
  {
    id: 21000558,
    name: "컴퓨터그래픽스",
    type: "전공선택",
    grade: 202,
    credit: 3,
    detail:
      "본 과목은 컴퓨터 그래픽스의 기본 원리 및 응용을 배운다. 그래픽스의 개요, 그래픽스용 하드웨어, 개발 환경 등을 배우며, C언어 또는 OPEN GL Tool을 이용하여 2차원, 3차원 Object의 표현 및 변화, 투시 투영도의 작성, 은둔선 제거, 조명 효과 등을 배운다.",
  },
  {
    id: 21000542,
    name: "운영체제",
    type: "전공필수",
    grade: 301,
    credit: 3,
    detail:
      "Computer System의 구조와 조직을 이해하고 Operating System의 기초와 설계능력을 배양함으로써 Hardware Rosource의 효율적인 운영과 사용자에게 최대의 편의를 줄 수 있는 최적의 Operating System의 구성 방안을 연구한다.    ",
  },
  {
    id: 21102905,
    name: "데이터마이닝및분석",
    type: "전공선택",
    grade: 301,
    credit: 3,
    detail:
      "데이터로부터 숨겨진 정보를 자동으로 추출하는 기술인 데이터마이닝의 기본 개념과 관련 분석 기법들을 학습한다. 데이터마이닝의 기본 문제인 연관규칙분석, 군집화, 분류, 이상치발견, 회귀분석 등에 대한 개념 및 관련 알고리즘들을 공부하고, 이들을 통해 데이터 분석을 위한 기반 지식들을 습득한다. R과 같은 프로그램을 사용하여 실제로 데이터마이닝 기법을 적용하는 방법도 학습한다.",
  },
  {
    id: 21102907,
    name: "사용자인터페이스",
    type: "전공선택",
    grade: 301,
    credit: 3,
    detail:
      "본 과목에서는 사용자 인터페이스 설계를 위한 원리 및 개발 방법을 배우며, 이를 설계(design), 구현(implementation) 및 평가(evaluation) 관점에서 접근한다. 설계에서는 바람직한 사용자 인터페이스를 설계하기 위해서 가시성, 오류 방지, 그래픽 설계 방법 등의 설계 원칙과 인간의 지각 능력, 색상에 대한 인지능력, 인간의 오류 등 인간의 역량 및 한계를 함께 고려한다. 구현 부분에서는 사용자 인터페이스를 만드는 다양한 기술 및 도구들을 배우며, 사용자 인터페이스를 평가하는 다양한 평가 방법 및 측정 기술들을 배운다.",
  },
  {
    id: 21102903,
    name: "소프트웨어분석및설계",
    type: "전공선택",
    grade: 301,
    credit: 3,
    detail:
      "소프트웨어 개발에 있어서 대상 시스템을 제대로 이해하고 분석하여 이를 바탕으로 소프트웨어를 설계하는 것은 매우 중요한 단계이다. 소프트웨어 개발을 위한 시스템 분석 및 설계(system analysis and design)는 현업에서 요구하는 내용을 조사, 분석하여 이를 개발하는 소프트웨어에 반영하기 위해 설계하는 과정을 이해하는 학문 분야이다. 이 교과목은 소프트웨어 개발을 위해 필요한 시스템 분석과 설계의 기본 개념과 기법들을 습득함을 목표로 한다. 이를 위해서 프로젝트 개시, 비즈니스 프로세스의 분석, 시스템 모델링 및 설계, 프로젝트 관리 등에 관해 이론과 실무를 중심으로 학습한다.",
  },
  {
    id: 21000549,
    name: "알고리즘",
    type: "전공필수",
    grade: 302,
    credit: 3,
    detail:
      "계산문제와 알고리즘의 개념, 알고리즘 표현 및 분석, 알고리즘 작성 기법과 정렬 및 검색, 그래프, 기하, 수리 등에의 응용, 병렬 알고리즘, 계산문제의 컴플렉서티 이론과 리덕션 등을 공부한다.    ",
  },
  {
    id: 21003183,
    name: "데이터베이스설계와질의",
    type: "전공선택",
    grade: 302,
    credit: 3,
    detail:
      "데이터베이스 설계의 요구 사항 분석과 논리적 설계, 대표적인 데이터베이스 모델링 기법인 ER(Entity Relationship) 모델을 배운다. ER 모델을 관계형 모델로 바꾸는 법을 배우며, 관계형 데이터베이스 질의를 위한 관계 대수와 대표적 상용 질의어인 SQL 을 학습하고, 데이터베이스 응용 프로그래밍 기법에 대한 기본 지식을 습득한다.    ",
  },
  {
    id: 21003757,
    name: "모바일소프트웨어",
    type: "전공선택",
    grade: 302,
    credit: 3,
    detail:
      "스마트폰, 태블릿과 같은 모바일 컴퓨팅 환경에 관련된 모바일 무선 통신, 응용 기술, 개발 플랫폼 및 개발 도구 등에 대한 기본적인 개념과 원리에 대하여 배우며, 프로그래밍 실습을 통하여 모바일 응용 프로그램을 설계하고 개발하는 지식을 습득한다.",
  },
  {
    id: 21102906,
    name: "빅데이터처리",
    type: "전공선택",
    grade: 302,
    credit: 3,
    detail:
      "대용량, 초고속, 다양성 등의 특징을 가지는 빅데이터를 처리하기 위한 개념, 이론, 기법, 플랫폼 등을 학습한다. 빅데이터의 저장을 위한 분산 저장 시스템, 빅데이터의 검색을 위한 NoSQL 데이터베이스, 빅데이터의 처리를 위한 MapReduce 등의 프로그래밍 기법들을 살펴보고, 빅데이터 처리를 위한 대표적 플랫폼인 Hadoop, Spark 등을 학습한다. 이와 함께 데이터마이닝과 같은 데이터분석 기술들이 이들 시스템에서 어떻게 수행되는지 알아본다.",
  },
  //   {
  //     id: 1111,
  //     name: "인터렉티브미디어",
  //     type: "전공선택",
  //     grade: 302,
  //     credit: 3,
  //     detail:
  //       "사용자가 가상공간 매체와 실시간 피드백을 받으며 상호작용을 하는 가상현실(virtual reality), 또는 게임 형식 컨텐츠에 관련된 이론과 개발 기법, 그리고 소프트웨어의 활용법을 배운다. 3D 그래픽스 이론, 가상공간 모델링(modeling), 애니메이션 및 게임 제작 기법, 스크립팅(scripting) 언어 등을 학습하며 프로젝트 수행을 통하여 자신이 직접 컨텐츠를 설계하고 구현한다.",
  //   },
  {
    id: 21000550,
    name: "인공지능",
    type: "전공선택",
    grade: 401,
    credit: 3,
    detail:
      "인공지능이란 컴퓨터를 인간과 같은 지능을 갖을 수 있도록 하는 학문이다. 지식의 여러 표현방법, 다양한 탐색방법, 경험을 기초로한 문제해결의 패러다임, 전문가 System, Planning, Running 등을 공부한다.",
  },
  {
    id: 21104166,
    name: "소프트웨어융합특강",
    type: "전공선택",
    grade: 401,
    credit: 3,
    detail: "소프트웨어 융합분야의 최신 Topic들을 다룬다.",
  },
  {
    id: 21104165,
    name: "바이오인포메틱스개론",
    type: "전공선택",
    grade: 401,
    credit: 3,
    detail:
      "Bioinformatics 학문에 대한 전반적인 개념을 다룬다. Genomics, Epigenomics 등의 생물학적 배경지식과 함께 생명정보 서열정렬(sequence alignment), 서열 패턴 검색(motif search), 등의 Bioinformatics 관련 알고리즘에 대한 기본 개념들과 Transcriptome 분석 등 생명정보 분석 방법들을 습득한다.",
  },
  {
    id: 21104167,
    name: "스토리지시스템",
    type: "전공선택",
    grade: 402,
    credit: 3,
    detail:
      "본 강의에서는 차세대 비휘발성 메모리 기반의 SSD (Solid State Drive)와 응용, 그리고 다양한 스토리지 시스템의 연구 분야를 다룬다.- 주제: 비휘발성 메모리의 종류와 특성, 비휘발성 메모리 기반의 SSD와 다양한 SSD 응용, Data deduplication, Hot and cold data identification, Storage tiering, SAN (Storage Area Network) /NAS (Network Attached Storage), 등",
  },
  {
    id: 21002031,
    name: "네트워크보안",
    type: "전공선택",
    grade: 402,
    credit: 3,
    detail:
      "인터넷에서의 각종 보안 위협의 이해와 대처를 위한 방법을 학습하며, 암호학, 패스워드, 보안 관련 도구, 전자 우편 보안, 운영체제별 보안, 방화벽, 웹 보안 등의 주제들을 포함한다.",
  },
  {
    id: 11111111,
    name: "클라우드시스템",
    type: "전공선택",
    grade: 402,
    credit: 3,
    detail:
      "클라우드 시스템 기술과 컴퓨팅 패러다임에 대해 학습한다. 클라우드 시스템을 구성하는 분산 시스템의 기 반 기술 및 시스템 모델, 미들웨어 서비스, 클러스터 컴퓨팅, 가상화 기술, 클라우드 프로그래밍 환경, SOA 등의 주요 내용을 살펴보고 이를 바탕으로 한 분산 시스템 설계 및 관리기법에 대한 내용과 최신 기 술 동향을 다룬다.",
  },
  {
    id: 21104603,
    name: "머신러닝",
    type: "전공선택",
    grade: 402,
    credit: 3,
    detail:
      "머신러닝은 최근들어 인공지능의 중요 분야로서 4차 산업혁명의 핵심 기술이다. 본 교과목에서는 머신러닝의 기초가 되는 선형대수, 확률, 최적화 등의수학 이론을 배우고, 다층 및 심층 신경망의 구조와 학습 이론을 배운다. 이를 기반으로 CNN, GAN, RNN 등의 최신 모델을 배우고 이를 활용한 다양한 적용 예를 함께 학습한다.",
  },
  {
    id: 21102909,
    name: "사물인터넷시스템",
    type: "전공선택",
    grade: 402,
    credit: 3,
    detail:
      "사물인터넷이란 인터넷을 기반으로 모든 사물을 연결하여 사람과 사물, 사물과 사물 간의 정보를 상호 소통 하는 지능형 기술 및 서비스를 의미한다. 본 교과목은 이러한 사물 인터넷의 기초와 특징을 이해하고 최신 동향을 살펴본다. 또한 사물인터넷 기반 시스템 설계용 시뮬레이션 툴을 사용하여 실습이 이루어지며, 이러 한 실습을 통해 사물 인터넷 기반 시스템을 설계하는 기본기술을 습득한다.",
  },
  {
    id: 11111111,
    name: "데이터종합분석 (캡스톤디자인)",
    type: "전공선택",
    grade: 400,
    credit: 3,
    detail:
      "기초설계, 심화설계 능력을 기반으로 종합설계 능력을 향상시키기 위한 방법으로 중대형 규모의 소프트웨어 설계 능력의 향상을 목표로 하고 있다. 수강생들은 졸업 작품 이전 학기에 이 과목을 수강하여 졸업작품과 연계할 수 있으며 주제 선정, 소프트웨어의 명세와 설계, 발표 등을 실습하며 3명으로 구성되는 팀 작업이 권장된다.",
  },
];

export const DScourseList = [
  {
    id: 21003917,
    name: "소프트웨어의이해",
    type: "전공선택",
    grade: 101,
    credit: 3,
    detail:
      "컴퓨터과학전공의 기초설계과목으로 창의적 공학설계의 기법을 이해하고 배운다. 주어진 제약조건 내에서 목적달성을 위한 공학설계와 프로젝트 기반의 접근방법을 통해, 팀별 작업과 고객지향적 설계 프로젝트를 효과적으로 수행하기 위한 개념설계 방법 및 프로젝트 관리도구들을 응용하는 방법을 학습한다. 또한, 설계 프로젝트 결과를 보고하는 수단을 체계화하며, 팀의 행동과 동적 활동에 유용한 통찰력을 부여하고, 공학실천에 있어서의 윤리에 대해서도 공부한다.    ",
  },
  {
    id: 21105230,
    name: "데이터통계입문",
    type: "전공선택",
    grade: 101,
    credit: 3,
    detail:
      "데이터 분석을 위한 통계 기본 이론을 익힌다. 기술통계 기법을 통한 데이터 분석 자료의 수집 및 정리, 확률 및 확률 분포를 학습한다. 또한 추리통계를 통한 추정 및 검정, 분산분석, 회귀 분석을 학습한다.     ",
  },
  {
    id: 21002147,
    name: "컴퓨터수학",
    type: "전공선택",
    grade: 102,
    credit: 3,
    detail:
      "컴퓨터과학의 이론적 기초가 되는 집합, 관계 및 함수, 조함, 그래프와 트리, 대수이론, 오토마타 등의 개념과 응용을 배운다.    ",
  },
  {
    id: 21105229,
    name: "파이썬데이터분석",
    type: "전공선택",
    grade: 102,
    credit: 3,
    detail:
      "데이터분석 및 데이터모델링에 필수적으로 활용되는 NumPy, SciPy, Pandas, Matplotlib, Scikit-learn 및 Tensorflow 등의 최신 파이썬 라이브러리들을 소개한다. 이를 습득하기 위한 강의와 Real 데이터를 다루는 부분적인 실습으로 교과목을 진행한다.    ",
  },
  {
    id: 21102904,
    name: "데이터사이언스개론",
    type: "전공필수",
    grade: 201,
    credit: 3,
    detail:
      "빅데이터 시대의 요구에 맞게 부상하고 있는 새로운 학제간 연구 분야인 데이터 사이언스의 개요를 다루는 교과목이다. 이 교과목을 통해 데이터의 통계, 데이터 시각화, 데이터의 분석 등의 문제 해결을 위한 여러 연구 도구나 기술들을 익히게 될 것이다. 본 교과목은 데이터 수집부터 분석에 이르는 과정, 데이터를 다루는 도구들, 통계적 모델과 기계 학습, 그리고 실생활 사례들을 중점적으로 다룰 것이다.    ",
  },
  {
    id: 21000540,
    name: "자료구조",
    type: "전공필수",
    grade: 201,
    credit: 3,
    detail:
      "데이터 및 정보의 효과적 처리를 위한 구성 방법과 분석, 추상적 자료형의 표현 및 이용, 이들을 활용하는 기본적인 알고리즘 등을 공부한다.    ",
  },
  {
    id: 11111111,
    name: "인공지능기초",
    type: "전공선택",
    grade: 201,
    credit: 3,
    detail:
      "인공지능이란 컴퓨터를 인간과 같은 지능을 갖을 수 있도록 하는 학문이다. 지식의 여러 표현방법, 다양한 탐색방법, 경험을 기초로한 문제해결의 패러다임, 전문가 System, Planning, Running 등을 공부한다.    ",
  },
  //   {
  //     id: 1111,
  //     name: "데이터마이닝및분석",
  //     type: "전공필수",
  //     grade: 100,
  //     credit: 3,
  //     detail:
  //       "데이터로부터 숨겨진 정보를 자동으로 추출하는 기술인 데이터마이닝의 기본 개념과 관련 분석 기법들을 학습한다. 데이터마이닝의 기본 문제인 연관규칙분석, 군집화, 분류, 이상치발견, 회귀분석 등에 대한 개념 및 관련 알고리즘들을 공부하고, 이들을 통해 데이터 분석을 위한 기반 지식들을 습득한다. R과 같은 프로그램을 사용하여 실제로 데이터마이닝 기법을 적용하는 방법도 학습한다.    ",
  //   },
  {
    id: 21000557,
    name: "자바프로그래밍",
    type: "전공선택",
    grade: 202,
    credit: 3,
    detail:
      "응용 소프트웨어 개발에 적합한 언어 및 개발 환경의 습득과 소프트웨어 개발 훈련을 목표로 한다.    ",
  },
  {
    id: 21001713,
    name: "리눅스시스템",
    type: "전공선택",
    grade: 202,
    credit: 3,
    detail:
      "데이터 처리와 응용을 위한 시스템을 파일 및 프로세스를 중심으로 학습한다. 파일의 기본 개념 및 사용법, 파일 구조, 파일 입출력, 프로세스 등을 Unix 시스템을 중심으로 공부하며 특히 파일을 이용한 대량의 데이터의 체계적 조직과 효율적 처리 기술을 습득한다.    ",
  },
  {
    id: 11111111,
    name: "AI수학",
    type: "전공선택",
    grade: 202,
    credit: 3,
    detail:
      "본 교과목에서는 인공지능을 공부하는데 필요한 수학적 지식들을 배운다. 인공지능에 활용되는 최대우도추정, 베이시안 추론등의 확률모델을 학습한다. 또한 벡터, 행렬의 기본 연산을 익히고 선형대수학의 원리를 습득하여 서포트 벡터 머신, 특잇값 분해 등의 알고리즘을 이해한다",
  },
  {
    id: 21000542,
    name: "운영체제",
    type: "전공필수",
    grade: 301,
    credit: 3,
    detail:
      "Computer System의 구조와 조직을 이해하고 Operating System의 기초와 설계능력을 배양함으로써 Hardware Rosource의 효율적인 운영과 사용자에게 최대의 편의를 줄 수 있는 최적의 Operating System의 구성 방안을 연구한다.    ",
  },
  {
    id: 11111111,
    name: "빅데이터처리",
    type: "전공선택",
    grade: 301,
    credit: 3,
    detail:
      "대용량, 초고속, 다양성 등의 특징을 가지는 빅데이터를 처리하기 위한 개념, 이론, 기법, 플랫폼 등을 학습한다. 빅데이터의 저장을 위한 분산 저장 시스템, 빅데이터의 검색을 위한 NoSQL 데이터베이스, 빅데이터의 처리를 위한 MapReduce 등의 프로그래밍 기법들을 살펴보고, 빅데이터 처리를 위한 대표적 플랫폼인 Hadoop, Spark 등을 학습한다. 이와 함께 데이터마이닝과 같은 데이터분석 기술들이 이들 시스템에서 어떻게 수행되는지 알아본다.    ",
  },
  {
    id: 11111111,
    name: "데이터시각화",
    type: "전공선택",
    grade: 301,
    credit: 3,
    detail:
      "데이터 시각화는 빅데이터 기술의 중요한 영역으로, 데이터를 이해하고 의사결정 인사이트를 얻는데 필수적이다. 본 과목에서는 데이터 시각화 표현 기법을 공부하며, 파이썬 matplotlib 라이브러리, 구글 데이터 스튜디오, MS Power BI, Tableau 등 대표적인 오픈 소스 시각화 툴을 소개하고 활용 방법을 학습한다.    ",
  },
  {
    id: 21104603,
    name: "머신러닝",
    type: "전공선택",
    grade: 301,
    credit: 3,
    detail:
      "머신러닝은 인공지능의 중요 분야로서 4차 산업혁명의 핵심 기술이다. 본 교과목에서는 머신러닝의 기초가 되는 선형대수, 확률, 최적화 등의 수학 이론을 배우고, 다층 및 심층 신경망의 구조와 학습 이론을 배운다. 이를 기반으로 CNN, GAN, RNN 등의 최신 모델을 배우고 이를 활용한 다양한 적용 예를 함께 학습한다.    ",
  },
  {
    id: 21000549,
    name: "알고리즘",
    type: "전공필수",
    grade: 302,
    credit: 3,
    detail:
      "계산문제와 알고리즘의 개념, 알고리즘 표현 및 분석, 알고리즘 작성 기법과 정렬 및 검색, 그래프, 기하, 수리 등에의 응용, 병렬 알고리즘, 계산문제의 컴플렉서티 이론과 리덕션 등을 공부한다.    ",
  },
  {
    id: 21003183,
    name: "데이터베이스설계와질의",
    type: "전공선택",
    grade: 302,
    credit: 3,
    detail:
      "데이터베이스 설계의 요구 사항 분석과 논리적 설계, 대표적인 데이터베이스 모델링 기법인 ER(Entity Relationship) 모델을 배운다. ER 모델을 관계형 모델로 바꾸는 법을 배우며, 관계형 데이터베이스 질의를 위한 관계 대수와 대표적 상용 질의어인 SQL 을 학습하고, 데이터베이스 응용 프로그래밍 기법에 대한 기본 지식을 습득한다.    ",
  },
  {
    id: 11111111,
    name: "빅데이터응용프로그래밍",
    type: "전공선택",
    grade: 302,
    credit: 3,
    detail:
      "빅데이터의 수집, 적재, 처리, 분석과 같은 빅데이터 전 주기 시스템의 이론과 실무지식을 습득하기 위하여 다양한 빅데이터 소프트웨어 플랫폼들과 아키텍처를 배운다. 그리고 단계적 파일럿 프로젝트의 구축 실습을 통해 빅데이터 기술의 이해와 실전 활용능력을 습득한다.    ",
  },
  {
    id: 21103791,
    name: "딥러닝",
    type: "전공선택",
    grade: 302,
    credit: 3,
    detail:
      "딥 러닝은 머신 러닝의 한 방법으로서 인공 신경망의 층을 깊게 쌓아올려 데이터를 학습하는 방식을 말한다. 컨볼루션 신경망, 순환신경망, 생성 모델 등 다양한 딥러닝 모델들과 이를 최적화 하는 방법들에 대해 학습하고 텐서플로우 파이토치 등 딥러닝 구축 라이브러리를 통하여 단계적 구축 방법을 학습한다.    ",
  },
  {
    id: 11111111,
    name: "DS융합특강",
    type: "전공선택",
    grade: 401,
    credit: 3,
    detail: "데이터사이언스 분야의 최신 주제들을 특강 형식으로 소개한다.    ",
  },
  {
    id: 11111111,
    name: "데이터종합분석(캡스톤디자인)",
    type: "전공선택",
    grade: 401,
    credit: 3,
    detail:
      "기초설계, 심화설계 능력을 기반으로 종합설계 능력을 향상시키기 위한 방법으로 중대형 규모의 소프트웨어 설계 능력의 향상을 목표로 하고 있다. 수강생들은 졸업 작품 이전 학기에 이 과목을 수강하여 졸업작품과 연계할 수 있으며 주제 선정, 소프트웨어의 명세와 설계, 발표 등을 실습하며 3명으로 구성되는 팀 작업이 권장된다.    ",
  },
  {
    id: 11111111,
    name: "클라우드시스템",
    type: "전공선택",
    grade: 401,
    credit: 3,
    detail:
      "클라우드 시스템 기술과 컴퓨팅 패러다임에 대해 학습한다. 클라우드 시스템을 구성하는 분산 시스템의 기 반 기술 및 시스템 모델, 미들웨어 서비스, 클러스터 컴퓨팅, 가상화 기술, 클라우드 프로그래밍 환경, SOA 등의 주요 내용을 살펴보고 이를 바탕으로 한 분산 시스템 설계 및 관리기법에 대한 내용과 최신 기 술 동향을 다룬다.    ",
  },
  {
    id: 21003184,
    name: "데이터베이스프로그래밍",
    type: "전공선택",
    grade: 401,
    credit: 3,
    detail:
      "데이터베이스 이론과 프로그래밍 기술을 이용한 데이터베이스 활용 기법을 습득한다. 이를 위해 고급 질의 기법, 데이터베이스를 활용한 프로그래밍 기법을 습득한다. 더 나아가 이를 적용한 실전 프로젝트를 통해 그 활용 기법을 확고히 정립한다. 데이터베이스활용 기법을 심도 있게 익힘으로써 과목을 이수한 후에는 데이터베이스 활용 개발자가 되도록 하는데 그 목표가 있다.    ",
  },
  {
    id: 11111111,
    name: "데이터사이언스통계분석",
    type: "전공선택",
    grade: 401,
    credit: 3,
    detail:
      "기초적인 통계학 외에 데이터 분석에 필요한 다양한 통계 분석 기법들을 학습한다. 회귀분석, 시계열분석, 탐색적분석, 범주형 자료분석, 다변량 분석 등 여러 통계 기반 분석 기법들을 폭넓게 학습한다.    ",
  },
  {
    id: 11111111,
    name: "자연어처리",
    type: "전공선택",
    grade: 401,
    credit: 3,
    detail:
      "본 교과목에서는 자연어처리에 필요한 기본 적인 수학, 텍스트 전처리, 어휘, 구문, 의미 분석 등의 핵심적인 원리를 배우고, 이를 이용하여 다양한 자연어처리 응용시스템과 딥러닝 기반의 자연어처리 방법들을 배운다.",
  },
  {
    id: 21102909,
    name: "사물인터넷시스템",
    type: "전공선택",
    grade: 402,
    credit: 3,
    detail:
      "사물인터넷이란 인터넷을 기반으로 모든 사물을 연결하여 사람과 사물, 사물과 사물 간의 정보를 상호 소통하는 지능형 기술 및 서비스를 의미한다. 본 교과목은 이러한 사물 인터넷의 기초와 특징을 이해하고 최신 동향을 살펴본다. 또한 사물인터넷 기반 시스템 설계용 시뮬레이션 툴을 사용하여 실습이 이루어지며, 이러한 실습을 통해 사물 인터넷 기반 시스템을 설계하는 기본 기술을 습득한다.    ",
  },
  {
    id: 11111111,
    name: "데이터종합분석(캡스톤디자인)",
    type: "전공선택",
    grade: 402,
    credit: 3,
    detail:
      "기초설계, 심화설계 능력을 기반으로 종합설계 능력을 향상시키기 위한 방법으로 중대형 규모의 소프트웨어 설계 능력의 향상을 목표로 하고 있다. 수강생들은 졸업 작품 이전 학기에 이 과목을 수강하여 졸업작품과 연계할 수 있으며 주제 선정, 소프트웨어의 명세와 설계, 발표 등을 실습하며 3명으로 구성되는 팀 작업이 권장된다.    ",
  },
  {
    id: 21003187,
    name: "영상정보처리",
    type: "전공선택",
    grade: 402,
    credit: 3,
    detail:
      "다양한 종류의 영상처리 응용을 위한 이론적인 내용과 이를 프로그램으로 구현하는 방법을 배운다. 영상처리 응용은 의료 영상의 해석, 로봇의 자동 주행 및 지능개선을 위한 시각 처리, 생체 정보 인식, 핸드폰 카메라를 이용한 응용, PDA/핸드폰 자동 문자 인식, 이미지 보안을 위한 Watermarking 등 실생활에 필요한 첨단 시스템에 응용되고 있다. 따라서 본 교과목의 구성은 영상처리 분야에 필요한 이론적인 내용을 배우는 강의식 수업과 이를 프로그램으로 구현하고 응용, 설계하는 PBL 수업을 함께 진행한다.    ",
  },
  {
    id: 11111111,
    name: "DS응용실습",
    type: "전공선택",
    grade: 402,
    credit: 3,
    detail:
      "데이터 사이언스 관련 응용 문제들을 오픈 소스를 활용하여 해결하는 실습을 진행한다.    ",
  },
  {
    id: 11111111,
    name: "바이오인포메틱스개론",
    type: "전공선택",
    grade: 402,
    credit: 3,
    detail:
      "Bioinformatics 학문에 대한 전반적인 개념을 다룬다. Genomics, Epigenomics 등의 생물학적 배경지식과 함께 생명정보 서열 정렬(sequence alignment), 서열 패턴 검색(motif search), 등의 Bioinformatics 관련 알고리즘에 대한 기본 개념들과 Transcriptome 분석 등 생명정보 분석 방법들을 습득한다.    ",
  },
];
